hackathon/src/Catalogs/Обращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Обращения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТональностьОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешний</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

hackathon/src/InformationRegisters/НавыкиСотрудников/НавыкиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НавыкиСотрудников</name>
  <resources>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКомпетенции</name>
    <type>
      <types>EnumRef.ТипыКомпетенцийСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/InformationRegisters/СостояниеОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеОбращений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СлужебныйКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обращения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

hackathon/src/InformationRegisters/ПоказателиSLAПоОбращениям/ПоказателиSLAПоОбращениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиSLAПоОбращениям</name>
  <resources>
    <name>Реакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Решение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовторнаяРеакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>CatalogRef.Обращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/AccumulationRegisters/ТрудозатратыОбращений/ТрудозатратыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТрудозатратыОбращений</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>CatalogRef.Обращения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

hackathon/src/Enums/СтатусыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/ПриоритетыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПриоритетыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Срочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <predefined>
    <items>
      <name>СистемныйПользователь</name>
      <description>AUTO</description>
    </items>
  </predefined>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>EnumRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

hackathon/src/Catalogs/Обращения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.Наименование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Обращение", Объект.Ссылка);
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Исполнитель", Пользователи.ТекущийПользователь());
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Статус = Перечисления.СтатусыОбращения.Новое; 
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	ПриоритетОбращения = Объект.Приоритет;
	ИсполнительНазначен = Ложь;
	СтатусВРаботе = Перечисления.СтатусыОбращения.ВРаботе;
	
	Если ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Срочный Тогда
		
	    МинимальныйТребуемыйБалл = 4;
	    
	ИначеЕсли ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Высокий Тогда
		
	    МинимальныйТребуемыйБалл = 3;
	    
	ИначеЕсли ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Средний Тогда
		
	    МинимальныйТребуемыйБалл = 2;
	    
	Иначе
		
	    МинимальныйТребуемыйБалл = 0; 
	    
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Обращения.Исполнитель КАК Исполнитель,
		|	КОЛИЧЕСТВО(Обращения.Ссылка) КАК КоличествоОбращений
		|ПОМЕСТИТЬ втЗанятость
		|ИЗ
		|	Справочник.Обращения КАК Обращения
		|ГДЕ
		|	Обращения.Статус = &Статус
		|СГРУППИРОВАТЬ ПО
		|	Обращения.Исполнитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НавыкиСотрудников.Сотрудник КАК Сотрудник,
		|	НавыкиСотрудников.КоличествоБаллов / НавыкиСотрудников.КоличествоВопросов КАК СреднийБалл,
		|	втЗанятость.КоличествоОбращений КАК КоличествоОбращений
		|ИЗ
		|	втЗанятость КАК втЗанятость
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НавыкиСотрудников КАК НавыкиСотрудников
		|		ПО втЗанятость.Исполнитель = НавыкиСотрудников.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОбращений";
	
	Запрос.УстановитьПараметр("Статус", СтатусВРаботе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.СреднийБалл = NULL Тогда 
		Если Выборка.СреднийБалл > МинимальныйТребуемыйБалл Тогда
			
    		Объект.Исполнитель = Выборка.Исполнитель;
    		ИсполнительНазначен = Истина;
    		Продолжить;
    		
		КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ИсполнительНазначен Тогда
		
		Сообщить("Не удалось автоматически подобрать оптимального Исполнителя");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьЧасы(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение", Объект.Ссылка));
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТрудозатрат

&НаКлиенте
Процедура СписокТрудозатратВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение, Регистратор", 
		Объект.Ссылка, Элемент.ТекущиеДанные.Регистратор));
			
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Отказ И Модифицированность Тогда 
		ЗаписатьСостояниеОбращенийНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьСостояниеОбращенийНаСервере()  
	
	ДатаСеанса = ТекущаяДатаСеанса();
	Объект.ДатаОбновления = ДатаСеанса;
	СтруктураОбращения = Новый Структура("Обращение, Сотрудник, Статус, СлужебныйКомментарий");
	СтруктураОбращения.Обращение = Объект.Ссылка;
	СтруктураОбращения.Статус = Объект.Статус;

	НовоеОбращение = Ложь;
	Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда 
		НовоеОбращение = Истина;			
	КонецЕсли;
	
	Если НовоеОбращение Тогда  	
		СтруктураОбращения.Сотрудник = Справочники.Пользователи.СистемныйПользователь;
		СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Обращение", Объект.Ссылка);
		ПоследнееОбращение = РегистрыСведений.СостояниеОбращений;
		ТекВерсияОбращения = ПоследнееОбращение.ПолучитьПоследнее(ДатаСеанса, Отбор);
		
		Если ТекВерсияОбращения.Статус = Объект.Статус Тогда 
			Возврат;
		Иначе  
			СтруктураОбращения.Сотрудник = Объект.Исполнитель;
			Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда  
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 	
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение принято в работу. Исполнитель: %1", Объект.Исполнитель); 
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение передано клиенту: %1", Объект.Автор);
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.Закрыто Тогда 	
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение закрыто"); 
			КонецЕсли; 
			
			Решение = 0;
			Реакция = 0;
			Если ТекВерсияОбращения.Статус = Перечисления.СтатусыОбращения.Новое И Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПервых.Период, &ТекПериод, МИНУТА) КАК Реакция
				|ИЗ
				|	РегистрСведений.СостояниеОбращений.СрезПервых КАК СостояниеОбращенийСрезПервых
				|ГДЕ
				|	СостояниеОбращенийСрезПервых.Обращение = &Обращение
				|	И СостояниеОбращенийСрезПервых.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращения.Новое)";
				
				Запрос.УстановитьПараметр("Обращение", Объект.Ссылка);
				Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Реакция = ВыборкаДетальныеЗаписи.Реакция; 
				КонецЦикла;
				
			ИначеЕсли ТекВерсияОбращения.Статус = Перечисления.СтатусыОбращения.ВРаботе И Объект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПоследних.Период, &ТекПериод, МИНУТА) КАК Решение
				|ИЗ
				|	РегистрСведений.СостояниеОбращений.СрезПоследних КАК СостояниеОбращенийСрезПоследних
				|ГДЕ
				|	СостояниеОбращенийСрезПоследних.Обращение = &Обращение
				|	И СостояниеОбращенийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращения.ВРаботе)";
				
				Запрос.УстановитьПараметр("Обращение", Объект.Ссылка); 
				Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Решение = ВыборкаДетальныеЗаписи.Решение; 
				КонецЦикла;		
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
	Запись = РегистрыСведений.ПоказателиSLAПоОбращениям.СоздатьМенеджерЗаписи();
    Запись.Обращение = Объект.Ссылка;
    Запись.Прочитать();

    Если Запись.Выбран() Тогда
        Запись.Реакция = Запись.Реакция + Реакция;
        Запись.Решение = Запись.Решение + Решение;
        Запись.Записать(Истина);
    Иначе
        Запись.Обращение = Объект.Ссылка;
        Запись.Реакция = Реакция;
        Запись.Решение = Решение;
        Запись.Записать(Истина);
    КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СостояниеОбращений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Обращение.Установить(Объект.Ссылка); 
	НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
	
	Запись = НаборЗаписей.Добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, СтруктураОбращения);
	Запись.Период = ДатаСеанса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти   
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастройкаТемы = ПолучитьТему(); 
	
	Если НастройкаТемы = ТемаКлиентскогоПриложения.Темная ИЛИ НастройкаТемы = ТемаКлиентскогоПриложения.Авто Тогда
		ТемнаяТема = Истина; 
	Иначе
		ТемнаяТема = Ложь;
	КонецЕсли;
	ЗатраченоМин = ПолучитьТрудоЗатраты() * 60;
	ОбновитьПрогресс(ЗатраченоМин,,, ТемнаяТема);
	
	Сотрудники = ПолучитьТрудоЗатратыПоСотрудникам(); 
	//Сотрудники = Новый Массив;
	//Сотрудники.Добавить(Новый Структура("ФИО,Часы", "Иванов Иван Иванович", 5.5));
	//Сотрудники.Добавить(Новый Структура("ФИО,Часы", "Петров Пётр Петрович", 3));
	//Сотрудники.Добавить(Новый Структура("ФИО,Часы", "Сидорова Мария Юрьевна", 8));
	
	ПолеСотрудникиHTML = ПолучитьHTMLВиджетаСотрудники(Сотрудники, ТемнаяТема);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТему()
	КлючНастройкиКлиентскогоПриложения = "Общее/НастройкиКлиентскогоПриложения";
	Возврат	ХранилищеСистемныхНастроек.Загрузить(КлючНастройкиКлиентскогоПриложения).ТемаКлиентскогоПриложения;
КонецФункции

&НаСервере
Функция ПолучитьТрудоЗатраты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТрудозатратыОбращенийОбороты.ЧасыОборот КАК ЧасыОборот
		|ИЗ
		|	РегистрНакопления.ТрудозатратыОбращений.Обороты КАК ТрудозатратыОбращенийОбороты
		|ГДЕ
		|	ТрудозатратыОбращенийОбороты.Обращение = &Обращение";
	
	Запрос.УстановитьПараметр("Обращение", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЧасыОборот;
	КонецЦикла;	
	
КонецФункции

&НаСервере
Функция ПолучитьТрудоЗатратыПоСотрудникам()
    Сотрудники = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТрудозатратыОбращенийОбороты.Исполнитель КАК Исполнитель,
		|	ТрудозатратыОбращенийОбороты.ЧасыОборот КАК ЧасыОборот
		|ИЗ
		|	РегистрНакопления.ТрудозатратыОбращений.Обороты КАК ТрудозатратыОбращенийОбороты
		|ГДЕ
		|	ТрудозатратыОбращенийОбороты.Обращение = &Обращение";
	
	Запрос.УстановитьПараметр("Обращение", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Сотрудники.Добавить(Новый Структура("ФИО,Часы", ВыборкаДетальныеЗаписи.Исполнитель, Число(ВыборкаДетальныеЗаписи.ЧасыОборот)));
	КонецЦикла;
	
	Возврат Сотрудники;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПрогресс(ЗатраченоМин, ОценкаМин = Неопределено, ОсталосьМин = Неопределено, ТемнаяТема = Ложь) Экспорт
	ПолеHTML = ПолучитьHTMLВиджета(ОценкаМин, ЗатраченоМин, ОсталосьМин, ТемнаяТема);
КонецПроцедуры


&НаКлиенте
Функция ПолучитьHTMLВиджета(EstMin, LogMin, RemMin = Неопределено, ТемнаяТема = Ложь) Экспорт
	// Если Осталось не задано, но есть Est и Log — считаем как max(0, Est - Log)
	Если RemMin = Неопределено И ЗначениеЗаполнено(EstMin) И ЗначениеЗаполнено(LogMin) Тогда
		RemMin = Макс(0, Число(EstMin) - Число(LogMin));
	КонецЕсли;

	// Пустая строка в data-* = «не определено»
	СтEst = ?(ЗначениеЗаполнено(EstMin), Строка(Число(EstMin)), "");
	СтRem = ?(ЗначениеЗаполнено(RemMin), Строка(Число(RemMin)), "");
	СтLog = ?(ЗначениеЗаполнено(LogMin), Строка(Число(LogMin)), "");

	// Параметры цвета зависят от темы
	ЦветПодписи = ?(ТемнаяТема, "#e5e7eb", "#111");
	ЦветЗнач    = ?(ТемнаяТема, "#f8fafc", "#111");
	ЦветГлуше   = ?(ТемнаяТема, "#9ca3af", "#64748b");
	ЦветТрек    = ?(ТемнаяТема, "#334155", "#e5e7eb");

	Шаблон =
"<!doctype html>
|<html lang='ru'>
|<head>
|<meta charset='utf-8'/>
|<meta name='viewport' content='width=device-width, initial-scale=1'/>
|<style>
|:root{
|  --muted:%MUTED%;
|  --track:%TRACK%;
|  --est:#3b82f6; --rem:#f59e0b; --log:#22c55e; --over:#ef4444;
|  font-family:-apple-system,Segoe UI,Roboto,Arial,sans-serif;
|}
|body{margin:0;padding:10px}
|.row{display:flex;align-items:center;gap:10px;margin:10px 0}
|.label{width:90px;font-size:13px;color:%LBL%}
|.track{flex:1;height:8px;background:var(--track);border-radius:999px;position:relative;overflow:hidden}
|.fill{position:absolute;top:0;height:100%;width:0;border-radius:999px;transition:width .2s ease}
|.fill.est{left:0;background:var(--est)}         /* оценка — 100% если >0 */
|.fill.rem{left:0;background:var(--rem)}         /* осталось — слева направо */
|.fill.log{left:0;background:var(--log)}         /* затрачено — слева направо */
|.row.over .fill.log{background:var(--over)}
|.value{width:120px;text-align:right;font-size:12px;color:%VAL%}
|.value.muted{color:var(--muted)}
|</style>
|</head>
|<body>
|  <div id='w' data-est='%EST%' data-rem='%REM%' data-log='%LOG%'>
|    <div class='row' id='row-est' data-kind=est>
|      <span class='label'>Оценка</span>
|      <div class='track'><div class='fill est' id='fill-est'></div></div>
|      <span class='value' id='val-est'></span>
|    </div>
|    <div class='row' id='row-rem' data-kind=rem>
|      <span class='label'>Осталось</span>
|      <div class='track'><div class='fill rem' id='fill-rem'></div></div>
|      <span class='value' id='val-rem'></span>
|    </div>
|    <div class='row' id='row-log' data-kind=log>
|      <span class='label'>Затрачено</span>
|      <div class='track'><div class='fill log' id='fill-log'></div></div>
|      <span class='value' id='val-log'></span>
|    </div>
|  </div>
|<script>
|(function(){
|  var w = document.getElementById('w');
|  function rd(s){ return (s==null || s==='') ? null : Number(s); } // пустая строка -> null
|  var est = rd(w.dataset.est);
|  var log = rd(w.dataset.log);
|  var rem = (w.dataset.rem==='' || w.dataset.rem==null) ? null : rd(w.dataset.rem);
|  if(rem===null && est!==null && log!==null){ rem = Math.max(0, est - log); }
|
|  function clamp(n,min,max){return Math.max(min, Math.min(max,n));}
|  function fmt(min){
|    if(min===null) return 'Не определено';
|    min = Math.max(0, Math.floor(+min));
|    var d=Math.floor(min/1440), h=Math.floor((min%1440)/60), m=min%60, out=[];
|    if(d) out.push(d+'d'); if(h) out.push(h+'h'); if(m || !out.length) out.push(m+'m'); return out.join(' ');
|  }
|  function width(kind, val, estVal){
|    if(kind==='est') return (estVal!=null && estVal>0) ? 100 : 0;
|    if(kind==='log'){
|      if(estVal==null || estVal<=0) return (val!=null && val>0) ? 100 : 0; // без оценки — 100%
|      if(val==null) return 0;
|      return clamp((val/estVal)*100, 0, 100);
|    }
|    // rem
|    if(estVal==null || estVal<=0 || val==null) return 0;
|    return clamp((val/estVal)*100, 0, 100);
|  }
|  function setRow(kind, val, estVal, idFill, idVal, idRow){
|    var fill = document.getElementById(idFill);
|    var v    = document.getElementById(idVal);
|    var row  = document.getElementById(idRow);
|    fill.style.width = width(kind, val, estVal) + '%';
|    v.textContent = fmt(val);
|    v.classList.toggle('muted', val===null);
|    if(kind==='log'){ row.classList.toggle('over', (estVal!=null && estVal>0 && val!=null && val>estVal)); }
|  }
|  setRow('est', est, est, 'fill-est', 'val-est', 'row-est');
|  setRow('rem', rem, est, 'fill-rem', 'val-rem', 'row-rem');
|  setRow('log', log, est, 'fill-log', 'val-log', 'row-log');
|})();
|</script>
|</body>
|</html>";

	HTML = СтрЗаменить(Шаблон, "%EST%", СтEst);
	HTML = СтрЗаменить(HTML,   "%REM%", СтRem);
	HTML = СтрЗаменить(HTML,   "%LOG%", СтLog);

	HTML = СтрЗаменить(HTML,   "%LBL%",   ЦветПодписи);
	HTML = СтрЗаменить(HTML,   "%VAL%",   ЦветЗнач);
	HTML = СтрЗаменить(HTML,   "%MUTED%", ЦветГлуше);
	HTML = СтрЗаменить(HTML,   "%TRACK%", ЦветТрек);

	Возврат HTML;
КонецФункции 

&НаКлиенте
Функция ПолучитьHTMLВиджетаСотрудники(Данные, ТемнаяТема) Экспорт
	//-- Цвета темы:
	ЦветПодписи = ?(ТемнаяТема, "#e5e7eb", "#111");
	ЦветЗнач    = ?(ТемнаяТема, "#f8fafc", "#111");
	ЦветГлуше   = ?(ТемнаяТема, "#9ca3af", "#64748b");
	ЦветТрек    = ?(ТемнаяТема, "#334155", "#e5e7eb");
	ЦветПолоса  = ?(ТемнаяТема, "#44e372", "#22c55e");

	//-- Формируем список строк
	HTMLСписок = "";
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Для Каждого Стр Из Данные Цикл
			ФИО = Стр.ФИО;
			Часы = Стр.Часы;
			СтЧасы = ?(Часы = Неопределено, "<span class='value muted'>Не&nbsp;определено</span>", 
				"<span class='value'>" + Формат(Число(Часы),"ЧГ=0.##") + " ч</span>");
			HTMLСписок = HTMLСписок +
			"<div class='row'><span class='label'>" + ФИО + "</span>" +
			"<div class='track'><div class='fill'></div></div>" + СтЧасы + "</div>";
		КонецЦикла;
	ИначеЕсли ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
		Для Каждого Р Из Данные Цикл
			ФИО = Р.ФИО;
			Часы = Р.Часы;
			СтЧасы = ?(Часы = Неопределено, "<span class='value muted'>Не&nbsp;определено</span>", 
				"<span class='value'>" + Формат(Число(Часы),"ЧГ=0.##") + " ч</span>");
			HTMLСписок = HTMLСписок +
			"<div class='row'><span class='label'>" + ФИО + "</span>" +
			"<div class='track'><div class='fill'></div></div>" + СтЧасы + "</div>";
		КонецЦикла;
	КонецЕсли;

	Шаблон =
"<!doctype html>
|<html lang='ru'>
|<head>
|<meta charset='utf-8'/>
|<style>
|:root{
|  --track:%TRACK%;
|  --main:%GREEN%;
|  --lbl:%LBL%;
|  --val:%VAL%;
|  --muted:%MUTED%;
|  font-family:-apple-system,Segoe UI,Roboto,Arial,sans-serif;
|}
|body{margin:0;padding:10px;}
|.row{display:flex;align-items:center;gap:10px;margin:9px 0}
|.label{width:190px;font-size:14px;color:%LBL%}
|.track{flex:1;height:8px;background:var(--track);border-radius:999px;position:relative;overflow:hidden}
|.fill{position:absolute;left:0;top:0;height:100%;width:100%;background:var(--main);border-radius:999px}
|.value{width:70px;text-align:right;font-size:13px;color:%VAL%}
|.value.muted{color:var(--muted);}
|</style>
|</head>
|<body>
|" + HTMLСписок + "
|</body>
|</html>";

	HTML = Шаблон;
	HTML = СтрЗаменить(HTML, "%LBL%",   ЦветПодписи);
	HTML = СтрЗаменить(HTML, "%VAL%",   ЦветЗнач);
	HTML = СтрЗаменить(HTML, "%MUTED%", ЦветГлуше);
	HTML = СтрЗаменить(HTML, "%TRACK%", ЦветТрек);
	HTML = СтрЗаменить(HTML, "%GREEN%", ЦветПолоса);

	Возврат HTML;
КонецФункции
